[
    {
        "name": "showmehow",
        "desc": "Show me how to do things in this mysterious environment...",
        "practice": [
            {
                "task": "'showmehow' is a command that you can type, just like any other command. Try typing it and see what happens.",
                "expected": "Hey.*",
                "success": "That's right! Though now you need to tell showmehow what task you want to try. This is called an 'argument'. Try giving showmehow an argument so that it knows what to do. Want to know what argument to give it? There's only one, and it just told you what it was.",
                "fail": "Nope, that wasn't what I thought would happen! Try typing just 'showmehow' and hit 'enter'. No more, no less (though surrounding spaces are okay)."
            },
            {
                "task": "Lets try giving an argument to 'showmehow'. Arguments are words that come after the main command",
                "expected": "'showmehow' is a command.*",
                "success": "Great!",
                "fail": "Hmmm. I want to know what happens when you ask how to use 'showmehow'",
                "environment": {
                    "NONINTERACTIVE": "1"
                }
            }
        ],
        "done": "Awesome! Now that we're done with that, maybe you can run 'showmehow' again to find out what other things you can do in this mysterious place...."
    },
    {
        "name": "joke",
        "desc": "Tell me a joke",
        "practice": [
            {
                "task": "'fortune' is a command that can tell you a joke",
                "expected": ".+",
                "success": "Ha-ha. Okay, lets try something even funnier.",
                "fail": "No?"
            },
            {
                "task": "In the shell, you can pipe (|) the output of commands around into other processes. One of these processes is 'cowsay'. See what happens when you try:\n    $ fortune | cowsay",
                "expected": "^.*_.*$",
                "success": "Moo!",
                "fail": "Hmmm, I thought a cow was going to say that."
            }
        ],
        "done": "Try some more jokes in the shell!"
    },
    {
        "name": "readfile",
        "desc": "Read a file",
        "practice": [
            {
                "task": "'cat' can be used to read files on your computer. Meow! Lets read the file on your computer which says what operating system we're running. That file is found at /etc/os-release",
                "expected": "NAME=.*",
                "success": "Endless OS, as expected. Meow!",
                "fail": "Hmmm, are you sure you're reading /etc/os-release?"
            },
            {
                "task": "And for good measure, lets get a cow to say it too.",
                "expected": "^.*_.*$",
                "success": "Moo!",
                "fail": "Did you get a cow to say what's in /etc/os-release? Try again"
            }
        ],
        "done": "You can read any file that is plain text using `cat`. Try it with files like /etc/resolve.conf"
    }
]
